{
	"aboutTitle": "About Legacy Restoration",
	"aboutContent": [
		"Legacy&rsquo;s mitigation and restoration services stand the test of time. Our management group has over 75 years of proven industry experience. We focus our expertise on getting you back on track after you&rsquo;ve endured the worst hardships imaginable. While disasters strike suddenly and turn your whole life upside down, our team is prepared to move quickly. Reach out to us and we will immediately begin the process of getting your property repaired. With locations throughout the country, along with our international support network, Legacy Restoration will be there when you need us most. We help customers recover from disasters of all sizes. Even when you&rsquo;ve lost all hope, we have a solution! We&rsquo;ve seen it all. Our nation-wide team is ready to restore your property quickly, no matter what the circumstances. You can rest peacefully, knowing that the best team in the industry is here to help.",
		"Fire damage mitigation is a two-step process. First, we start by drying everything out and removing any water damage. Fires cause water damage in a number of ways: water from firefighters, damaged pipes and possible rain or snow while the fire happens. We dry out any water residue/humidity and remove anything that is damaged. The second step is clearing the smoke damage. Soot residue needs to be removed immediately. We reach the smallest areas of the home to clear smoke damage and deodorize your property. Then, we can begin rebuilding."
	],
	"branch": [
		"Tampa: 813-498-1357",
		"Fort Myers: 239-329-5982"
	],
	"aboutSubTitle": "We Specialize in Disaster Restoration",
	"servicesContent": [
		"Fire damage restoration is a two-step process. First, we start by drying everything and removing any water damage. Fires cause water damage in a number of ways. We dry out any water residue/humidity and remove anything that is damaged. The second step is clearing the smoke damage. Soot residue needs to be removed immediately. We reach the smallest areas of the home to clear smoke damage and deodorize your property. Then, we can begin rebuilding. We are your fire damage restoration experts!",
		"We are your water damage restoration experts! Water damage mitigation starts by stopping water from spreading to other areas. Once we control the source, we remove any water and dry out the property. That also includes removing moisture from the air with dehumidifiers. Electrical, flooring and drywall may need to be removed to prevent the spread of mold. After all the water-damaged materials are dried or removed, we can start the process of restoring your property to its pre-loss condition. We quickly get you back to normal!",
		"After a storm, we remove any debris and damaged items. One of the biggest concerns with storm damage mitigation is water. We must remove anything the water touched to prevent secondary damage and ensure a safe environment. After all the damage is removed, then we can begin restoration.",
		"Mold remediation is a multi-step process. The initial step is identifying the source of the mold and applying an antimicrobial to stop its spread. Containment is key. We then scrub the air by creating evaporation and drying it out. This ensures that mold spores and other airborne debris are removed. The only way to properly repair the damage is to remove any contaminated areas. Removal often includes removing carpet, wood trim, drywall, insulation and even furniture. After all the mold is removed, we will replace and repair all the affected areas.",
		"Reconstruction, more colloquially-known as the \"put back,\" is where we restore your property back to its pre-loss condition using contruction processes. Any components that were moved during mitigation or remediation like dry wall, baseboards, flooring, etc., are replaced with new materials. We provide a wide-range of reconstruction services depending on the scope of the demolition required during mitigation or remediation",
		"Life happens, and when it does, you need someone you can count on during your most challenging moments. At Legacy Restoration, our trained team of professionals can handle any type of biohazard or trauma cleanup. This includes accidental or undiscovered death cleanup, blood, and more. No family or friend should have to cleanup after these types of events. Contact our trusted team to help. We can work with your insurance carrier since most policies cover these types of events.",
		"We provide emergency board-up and tarp services. Whether the security of your home is compromised from a broken window or door from a burglary, after a fire, or from a storm, we have you covered! We can get your home boarded up or your roof protected with a tarp 24/7. "
	],
	"copyrightContent": "© Copyright 2023, Legacy Restoration, LLC",
	"phoneLink": "tel:+18882495867",
	"phoneNumber": "888-249-5867",
	"phoneText": "Our disaster recovery team is always available. Call any time and our experts will work tirelessly to get your life back on track.",
	"phoneTitle": "Emergency?"
}